#pragma once


/************************************************************************/
/*
//	贪吃蛇头部类头文件
//	创建人：许立龙
//	创建时间：2017年01月12日
//	最后修改时间：2017年01月12日
*/
/************************************************************************/
#include "cocos2d.h"
//思路-----------------------------------------------------------------------------------------------------------------------//思路
//////////////////////////////////////////////////////////////////////////
/*
先画蛇头，并控制蛇头任意方向移动


*/
//////////////////////////////////////////////////////////////////////////
//思路-----------------------------------------------------------------------------------------------------------------------//思路


USING_NS_CC;

class SnakeHead : public Sprite
{
public:
	//初始化的时候先是创建一个图片对象
	virtual bool init();

	//然后不断的更新蛇的运动方向
	CREATE_FUNC(SnakeHead);

	//创建蛇的运动方式
	/*
	蛇的运动方式多种多样，我们定义12个方向
	*/
	void move(int nDirection, int nSpeed);

	//创建方向
private:
	float speed;
	float fastSpeed;
	Size visibleSize;
};

//class SnakeFrame :public SpriteFrameCache
//{
//public:
//	SnakeFrame : public SpriteFrameCache();
//				 ~SnakeFrame:public SpriteFrameCache();
//
//private:
//
//};
